const fs = require('fs');

const input = [
    {
        "标题": "毛泽东传",
        "作者": "亚历山大·潘佐夫 ",
        "读完日期": "Mon Nov 25 00:00:00 GMT 2019",
        "类别": [
            "历史传记"
        ],
        "备注": ""
    },
    {
        "标题": "呼兰河传",
        "作者": "萧红 ",
        "读完日期": "Thu Dec 05 00:00:00 GMT 2019",
        "类别": [
            "文学"
        ],
        "备注": ""
    },
    {
        "标题": "让大脑自由",
        "作者": "约翰·梅迪纳 ",
        "读完日期": "Fri Mar 20 00:00:00 GMT 2020",
        "类别": [
            "科普"
        ],
        "备注": ""
    },
    {
        "标题": "人类简史",
        "作者": "尤瓦尔·赫拉利 ",
        "读完日期": "Mon Apr 20 00:00:00 GMT 2020",
        "类别": [
            "历史传记"
        ],
        "备注": ""
    },
    {
        "标题": "杀死一只知更鸟",
        "作者": "哈珀·李 ",
        "读完日期": "Wed May 20 00:00:00 GMT 2020",
        "类别": [
            "文学"
        ],
        "备注": ""
    },
    {
        "标题": "叫魂：17世纪妖术大恐慌",
        "作者": "孔飞力 ",
        "读完日期": "Sun Aug 30 00:00:00 GMT 2020",
        "类别": [
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "为什么长大",
        "作者": "苏珊·奈曼 ",
        "读完日期": "Sun Sep 20 00:00:00 GMT 2020",
        "类别": [
            "哲学"
        ],
        "备注": ""
    },
    {
        "标题": "国家的艺术：文化、修辞与公共管理",
        "作者": "克里斯托弗·胡德 ",
        "读完日期": "Thu Sep 24 00:00:00 GMT 2020",
        "类别": [
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "社会主义体制",
        "作者": "雅诺什·科尔奈 ",
        "读完日期": "Thu Oct 08 00:00:00 GMT 2020",
        "类别": [
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "白夜",
        "作者": "贾平凹 ",
        "读完日期": "Sun Oct 18 00:00:00 GMT 2020",
        "类别": [
            "文学"
        ],
        "备注": ""
    },
    {
        "标题": "自由论",
        "作者": "以赛亚·柏林 ",
        "读完日期": "Thu Nov 05 00:00:00 GMT 2020",
        "类别": [
            "哲学"
        ],
        "备注": ""
    },
    {
        "标题": "形式基础",
        "作者": "周至禹 ",
        "读完日期": "Sun Nov 15 00:00:00 GMT 2020",
        "类别": [
            "美术设计"
        ],
        "备注": "略读"
    },
    {
        "标题": "卢梭全集第一卷 忏悔录（上）",
        "作者": "卢梭 ",
        "读完日期": "Mon Nov 16 00:00:00 GMT 2020",
        "类别": [
            "历史传记"
        ],
        "备注": ""
    },
    {
        "标题": "卢梭全集第二卷 忏悔录（下）",
        "作者": "卢梭 ",
        "读完日期": "Tue Nov 24 00:00:00 GMT 2020",
        "类别": [
            "历史传记"
        ],
        "备注": ""
    },
    {
        "标题": "卢梭全集第三卷 一个孤独的散步者的梦及其它",
        "作者": "卢梭 ",
        "读完日期": "Wed Nov 25 00:00:00 GMT 2020",
        "类别": [
            "文学"
        ],
        "备注": ""
    },
    {
        "标题": "卢梭全集第四卷 社会契约论与其他两篇论文",
        "作者": "卢梭 ",
        "读完日期": "Sun Nov 29 00:00:00 GMT 2020",
        "类别": [
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "社会研究中的基础统计学",
        "作者": "",
        "读完日期": "Thu Dec 03 00:00:00 GMT 2020",
        "类别": [
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "卢梭全集第五卷 致达朗贝尔的信、政治经济学、山中来信及其它",
        "作者": "卢梭 ",
        "读完日期": "Fri Dec 11 00:00:00 GMT 2020",
        "类别": [
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "聊斋志异",
        "作者": "蒲松林 ",
        "读完日期": "Sat Dec 12 00:00:00 GMT 2020",
        "类别": [
            "文学"
        ],
        "备注": ""
    },
    {
        "标题": "留白",
        "作者": "费工信等 ",
        "读完日期": "Tue Dec 22 00:00:00 GMT 2020",
        "类别": [
            "美术设计"
        ],
        "备注": ""
    },
    {
        "标题": "金钱不能买什么",
        "作者": "迈克尔•桑德尔 ",
        "读完日期": "Fri Feb 05 00:00:00 GMT 2021",
        "类别": [
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "20年目睹之怪现状",
        "作者": "吴研人 ",
        "读完日期": "Sat Feb 06 00:00:00 GMT 2021",
        "类别": [
            "文学"
        ],
        "备注": ""
    },
    {
        "标题": "邓小平时代",
        "作者": "傅高义 ",
        "读完日期": "Tue Feb 16 00:00:00 GMT 2021",
        "类别": [
            "历史传记"
        ],
        "备注": ""
    },
    {
        "标题": "大断裂：人类本性与社会秩序的重建",
        "作者": "弗朗西斯•福山 ",
        "读完日期": "Fri Feb 19 00:00:00 GMT 2021",
        "类别": [
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "政治秩序的起源：从前人类时代到法国大革命",
        "作者": "弗朗西斯•福山 ",
        "读完日期": "Sun Mar 07 00:00:00 GMT 2021",
        "类别": [
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "政府论•上篇",
        "作者": "洛克 ",
        "读完日期": "Mon Mar 08 00:00:00 GMT 2021",
        "类别": [
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "马基雅维里政治著作选",
        "作者": "马基雅维里 ",
        "读完日期": "Wed Mar 10 00:00:00 GMT 2021",
        "类别": [
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "当代比较政治学：世界视野",
        "作者": "",
        "读完日期": "Sun Mar 21 00:00:00 GMT 2021",
        "类别": [
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "卢梭全集第六卷 爱弥尔（上）",
        "作者": "卢梭 ",
        "读完日期": "Tue Mar 23 00:00:00 GMT 2021",
        "类别": [
            "哲学"
        ],
        "备注": ""
    },
    {
        "标题": "卢梭全集第七卷 爱弥尔（下）",
        "作者": "卢梭 ",
        "读完日期": "Sat Mar 27 00:00:00 GMT 2021",
        "类别": [
            "哲学"
        ],
        "备注": ""
    },
    {
        "标题": "史记（卷一至卷十五）",
        "作者": "司马迁 ",
        "读完日期": "Tue Mar 30 00:00:00 GMT 2021",
        "类别": [
            "历史传记"
        ],
        "备注": ""
    },
    {
        "标题": "史记（卷十六至卷三十七）",
        "作者": "司马迁 ",
        "读完日期": "Tue Apr 06 00:00:00 GMT 2021",
        "类别": [
            "历史传记"
        ],
        "备注": ""
    },
    {
        "标题": "史记（卷三十八至卷八十三）",
        "作者": "司马迁 ",
        "读完日期": "Sat Apr 10 00:00:00 GMT 2021",
        "类别": [
            "历史传记"
        ],
        "备注": ""
    },
    {
        "标题": "政府论•下篇",
        "作者": "洛克 ",
        "读完日期": "Sun Apr 11 00:00:00 GMT 2021",
        "类别": [
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "国富论",
        "作者": "亚当•斯密 ",
        "读完日期": "Thu Apr 22 00:00:00 GMT 2021",
        "类别": [
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "黄金时代",
        "作者": "王小波 ",
        "读完日期": "Sat Apr 24 00:00:00 GMT 2021",
        "类别": [
            "文学"
        ],
        "备注": ""
    },
    {
        "标题": "中国政治思想史",
        "作者": "萧公权 ",
        "读完日期": "Mon May 03 00:00:00 GMT 2021",
        "类别": [
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "沈从文小说选",
        "作者": "沈从文 ",
        "读完日期": "Sun May 09 00:00:00 GMT 2021",
        "类别": [
            "文学"
        ],
        "备注": ""
    },
    {
        "标题": "史记（卷三十四至卷一百三十）",
        "作者": "司马迁 ",
        "读完日期": "Mon May 10 00:00:00 GMT 2021",
        "类别": [
            "历史传记"
        ],
        "备注": ""
    },
    {
        "标题": "权力论",
        "作者": "伯特兰•罗素 ",
        "读完日期": "Wed May 12 00:00:00 GMT 2021",
        "类别": [
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "公共事务的治理之道",
        "作者": "埃莉诺•奥斯特罗姆 ",
        "读完日期": "Fri May 28 00:00:00 GMT 2021",
        "类别": [
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "中国共产党中央委员会关于建国以来党的若干历史问题的决议",
        "作者": "",
        "读完日期": "Sun Jun 06 00:00:00 GMT 2021",
        "类别": [
            "历史传记"
        ],
        "备注": ""
    },
    {
        "标题": "中国共产党的三十年",
        "作者": "胡乔木 ",
        "读完日期": "Sun Jun 13 00:00:00 GMT 2021",
        "类别": [
            "历史传记"
        ],
        "备注": ""
    },
    {
        "标题": "骆驼祥子",
        "作者": "老舍 ",
        "读完日期": "Tue Jun 15 00:00:00 GMT 2021",
        "类别": [
            "文学"
        ],
        "备注": ""
    },
    {
        "标题": "邓小平理论与当代中国基本问题",
        "作者": "冷溶 ",
        "读完日期": "Tue Jun 15 00:00:00 GMT 2021",
        "类别": [
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "小王子",
        "作者": "圣埃里克苏佩里 ",
        "读完日期": "Wed Jun 16 00:00:00 GMT 2021",
        "类别": [
            "文学"
        ],
        "备注": ""
    },
    {
        "标题": "论实证精神",
        "作者": "奥古斯特•孔德 ",
        "读完日期": "Sun Jun 27 00:00:00 GMT 2021",
        "类别": [
            "哲学"
        ],
        "备注": ""
    },
    {
        "标题": "人性论",
        "作者": "大卫•休谟 ",
        "读完日期": "Tue Jul 20 00:00:00 GMT 2021",
        "类别": [
            "哲学"
        ],
        "备注": ""
    },
    {
        "标题": "银河系边缘的小失常",
        "作者": "艾特加•凯雷特 ",
        "读完日期": "Sun Jul 25 00:00:00 GMT 2021",
        "类别": [
            "文学"
        ],
        "备注": ""
    },
    {
        "标题": "鲁迅作品集：呐喊•彷徨•朝花夕拾•故事新编",
        "作者": "鲁迅 ",
        "读完日期": "Thu Aug 05 00:00:00 GMT 2021",
        "类别": [
            "文学"
        ],
        "备注": ""
    },
    {
        "标题": "万历十五年",
        "作者": "黄仁宇 ",
        "读完日期": "Fri Aug 13 00:00:00 GMT 2021",
        "类别": [
            "历史传记",
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "自私的基因",
        "作者": "理查德•道金斯 ",
        "读完日期": "Sun Aug 22 00:00:00 GMT 2021",
        "类别": [
            "科普"
        ],
        "备注": ""
    },
    {
        "标题": "乡土中国",
        "作者": "费孝通 ",
        "读完日期": "Mon Aug 23 00:00:00 GMT 2021",
        "类别": [
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "给青年的十二封信",
        "作者": "朱光潜 ",
        "读完日期": "Tue Aug 24 00:00:00 GMT 2021",
        "类别": [
            "哲学"
        ],
        "备注": ""
    },
    {
        "标题": "乌合之众",
        "作者": "勒庞 ",
        "读完日期": "Sun Aug 29 00:00:00 GMT 2021",
        "类别": [
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "变化社会中的政治秩序",
        "作者": "萨缪尔•亨廷顿 ",
        "读完日期": "Wed Sep 15 00:00:00 GMT 2021",
        "类别": [
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "雇佣劳动和资本",
        "作者": "马克思 ",
        "读完日期": "Thu Sep 16 00:00:00 GMT 2021",
        "类别": [
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "飘",
        "作者": "玛格丽特•米切尔 ",
        "读完日期": "Fri Sep 17 00:00:00 GMT 2021",
        "类别": [
            "文学"
        ],
        "备注": ""
    },
    {
        "标题": "追风筝的人",
        "作者": "卡勒德•胡赛尼 ",
        "读完日期": "Sun Sep 26 00:00:00 GMT 2021",
        "类别": [
            "文学"
        ],
        "备注": ""
    },
    {
        "标题": "论美国的民主（上）",
        "作者": "托克维尔 ",
        "读完日期": "Tue Sep 28 00:00:00 GMT 2021",
        "类别": [
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "宪法秩序的经济学与伦理学",
        "作者": "詹姆斯•M.布坎南 ",
        "读完日期": "Sat Oct 02 00:00:00 GMT 2021",
        "类别": [
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "论美国的民主（下）",
        "作者": "托克维尔 ",
        "读完日期": "Tue Oct 05 00:00:00 GMT 2021",
        "类别": [
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "偶像的黄昏",
        "作者": "尼采 ",
        "读完日期": "Sat Oct 09 00:00:00 GMT 2021",
        "类别": [
            "哲学"
        ],
        "备注": ""
    },
    {
        "标题": "红楼梦（上）",
        "作者": "曹雪芹 胭脂斋评 ",
        "读完日期": "Sat Oct 16 00:00:00 GMT 2021",
        "类别": [
            "文学"
        ],
        "备注": ""
    },
    {
        "标题": "红楼梦（下）",
        "作者": "曹雪芹 胭脂斋评 ",
        "读完日期": "Tue Oct 19 00:00:00 GMT 2021",
        "类别": [
            "文学"
        ],
        "备注": ""
    },
    {
        "标题": "1984",
        "作者": "乔治•奥威尔 ",
        "读完日期": "Thu Oct 21 00:00:00 GMT 2021",
        "类别": [
            "文学"
        ],
        "备注": ""
    },
    {
        "标题": "月亮和六便士",
        "作者": "毛姆 ",
        "读完日期": "Sat Oct 23 00:00:00 GMT 2021",
        "类别": [
            "文学"
        ],
        "备注": ""
    },
    {
        "标题": "变量：看见中国社会小趋势",
        "作者": "何帆 ",
        "读完日期": "Tue Oct 26 00:00:00 GMT 2021",
        "类别": [
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "钢铁是怎样炼成的",
        "作者": "奥斯特洛夫斯基 ",
        "读完日期": "Thu Oct 28 00:00:00 GMT 2021",
        "类别": [
            "文学"
        ],
        "备注": ""
    },
    {
        "标题": "西西弗神话",
        "作者": "加缪 ",
        "读完日期": "Fri Oct 29 00:00:00 GMT 2021",
        "类别": [
            "哲学"
        ],
        "备注": ""
    },
    {
        "标题": "沉默的大多数",
        "作者": "王小波 ",
        "读完日期": "Sat Oct 30 00:00:00 GMT 2021",
        "类别": [
            "文学"
        ],
        "备注": ""
    },
    {
        "标题": "老人与海",
        "作者": "海明威 ",
        "读完日期": "Sun Oct 31 00:00:00 GMT 2021",
        "类别": [
            "文学"
        ],
        "备注": ""
    },
    {
        "标题": "变形记",
        "作者": "卡夫卡 ",
        "读完日期": "Sun Oct 31 00:00:00 GMT 2021",
        "类别": [
            "文学"
        ],
        "备注": ""
    },
    {
        "标题": "江村经济",
        "作者": "费孝通 ",
        "读完日期": "Mon Nov 01 00:00:00 GMT 2021",
        "类别": [
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "罗生门",
        "作者": "芥川龙之介 ",
        "读完日期": "Wed Nov 03 00:00:00 GMT 2021",
        "类别": [
            "文学"
        ],
        "备注": ""
    },
    {
        "标题": "瓦尔登湖",
        "作者": "梭罗 ",
        "读完日期": "Thu Nov 04 00:00:00 GMT 2021",
        "类别": [
            "文学"
        ],
        "备注": ""
    },
    {
        "标题": "地下室手记",
        "作者": "陀思妥耶夫斯基 ",
        "读完日期": "Fri Nov 05 00:00:00 GMT 2021",
        "类别": [
            "文学"
        ],
        "备注": ""
    },
    {
        "标题": "理想国",
        "作者": "柏拉图 ",
        "读完日期": "Fri Nov 05 00:00:00 GMT 2021",
        "类别": [
            "哲学",
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "在细雨中呼喊",
        "作者": "余华 ",
        "读完日期": "Sun Nov 07 00:00:00 GMT 2021",
        "类别": [
            "文学"
        ],
        "备注": ""
    },
    {
        "标题": "中国国家治理的制度逻辑",
        "作者": "周雪光 ",
        "读完日期": "Wed Nov 10 00:00:00 GMT 2021",
        "类别": [
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "身份与暴力",
        "作者": "阿玛蒂亚•森 ",
        "读完日期": "Wed Nov 10 00:00:00 GMT 2021",
        "类别": [
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "置身事内",
        "作者": "兰小欢 ",
        "读完日期": "Thu Nov 11 00:00:00 GMT 2021",
        "类别": [
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "家庭、私有制和国家的起源",
        "作者": "恩格斯 ",
        "读完日期": "Fri Nov 12 00:00:00 GMT 2021",
        "类别": [
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "静静的顿河（上）",
        "作者": "肖洛霍夫 ",
        "读完日期": "Sun Nov 14 00:00:00 GMT 2021",
        "类别": [
            "文学"
        ],
        "备注": ""
    },
    {
        "标题": "爸爸爸",
        "作者": "韩少功 ",
        "读完日期": "Mon Nov 15 00:00:00 GMT 2021",
        "类别": [
            "文学"
        ],
        "备注": ""
    },
    {
        "标题": "局外人•鼠疫",
        "作者": "加缪 ",
        "读完日期": "Fri Nov 19 00:00:00 GMT 2021",
        "类别": [
            "文学"
        ],
        "备注": ""
    },
    {
        "标题": "罪与罚",
        "作者": "陀思妥耶夫斯基 ",
        "读完日期": "Tue Nov 23 00:00:00 GMT 2021",
        "类别": [
            "文学"
        ],
        "备注": ""
    },
    {
        "标题": "新乡土中国",
        "作者": "贺雪峰 ",
        "读完日期": "Wed Nov 24 00:00:00 GMT 2021",
        "类别": [
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "庄子注疏",
        "作者": "庄子 郭象 成玄英 ",
        "读完日期": "Sat Dec 04 00:00:00 GMT 2021",
        "类别": [
            "哲学"
        ],
        "备注": ""
    },
    {
        "标题": "朱镕基讲话实录 第一卷",
        "作者": "朱镕基 ",
        "读完日期": "Tue Dec 07 00:00:00 GMT 2021",
        "类别": [
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "红高粱家族",
        "作者": "莫言 ",
        "读完日期": "Wed Dec 08 00:00:00 GMT 2021",
        "类别": [
            "文学"
        ],
        "备注": ""
    },
    {
        "标题": "美的历程",
        "作者": "李泽厚 ",
        "读完日期": "Fri Dec 10 00:00:00 GMT 2021",
        "类别": [
            "哲学",
            "美术设计"
        ],
        "备注": ""
    },
    {
        "标题": "中华慧命续千年",
        "作者": "萧萐父 ",
        "读完日期": "Sun Dec 26 00:00:00 GMT 2021",
        "类别": [
            "哲学"
        ],
        "备注": ""
    },
    {
        "标题": "娱乐至死",
        "作者": "尼尔•波兹曼 ",
        "读完日期": "Tue Jan 11 00:00:00 GMT 2022",
        "类别": [
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "上帝掷骰子吗：量子物理史话",
        "作者": "曹天元 ",
        "读完日期": "Sat Jan 15 00:00:00 GMT 2022",
        "类别": [
            "科普"
        ],
        "备注": ""
    },
    {
        "标题": "美丽新世界",
        "作者": "奥尔德斯•赫胥黎 ",
        "读完日期": "Mon Jan 24 00:00:00 GMT 2022",
        "类别": [
            "文学",
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "经典常谈",
        "作者": "朱自清 ",
        "读完日期": "Thu Jan 27 00:00:00 GMT 2022",
        "类别": [
            "哲学"
        ],
        "备注": ""
    },
    {
        "标题": "中国官僚政治研究",
        "作者": "王亚南 ",
        "读完日期": "Sat Feb 05 00:00:00 GMT 2022",
        "类别": [
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "浮生六记",
        "作者": "沈复 ",
        "读完日期": "Mon Feb 14 00:00:00 GMT 2022",
        "类别": [
            "文学"
        ],
        "备注": ""
    },
    {
        "标题": "心安即是归处",
        "作者": "季羡林 ",
        "读完日期": "Wed Feb 16 00:00:00 GMT 2022",
        "类别": [
            "文学"
        ],
        "备注": ""
    },
    {
        "标题": "新教伦理与资本主义精神",
        "作者": "马克斯•韦伯 ",
        "读完日期": "Thu Feb 17 00:00:00 GMT 2022",
        "类别": [
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "马克思恩格斯文集第一卷选读 黑格尔法哲学批判导言、论犹太人问题、关于费尔巴哈的提纲、德意志意识形态、1844年经济学哲学手稿",
        "作者": "马克思 恩格斯 ",
        "读完日期": "Mon Feb 28 00:00:00 GMT 2022",
        "类别": [
            "社会科学",
            "哲学"
        ],
        "备注": ""
    },
    {
        "标题": "聊斋志异",
        "作者": "蒲松龄 ",
        "读完日期": "Fri Mar 11 00:00:00 GMT 2022",
        "类别": [
            "文学"
        ],
        "备注": ""
    },
    {
        "标题": "盐铁论",
        "作者": "桓宽 ",
        "读完日期": "Sat Mar 12 00:00:00 GMT 2022",
        "类别": [
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "第九个寡妇",
        "作者": "严歌苓 ",
        "读完日期": "Sun Mar 13 00:00:00 GMT 2022",
        "类别": [
            "文学"
        ],
        "备注": ""
    },
    {
        "标题": "尼各马可伦理学",
        "作者": "亚里士多德 ",
        "读完日期": "Mon Mar 14 00:00:00 GMT 2022",
        "类别": [
            "哲学"
        ],
        "备注": ""
    },
    {
        "标题": "利维坦：论国家",
        "作者": "霍布斯 ",
        "读完日期": "Thu Mar 17 00:00:00 GMT 2022",
        "类别": [
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "想象的共同体",
        "作者": "本尼迪克特·安德森 ",
        "读完日期": "Mon Mar 21 00:00:00 GMT 2022",
        "类别": [
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "百年孤独",
        "作者": "马尔克斯 ",
        "读完日期": "Wed Mar 23 00:00:00 GMT 2022",
        "类别": [
            "文学"
        ],
        "备注": ""
    },
    {
        "标题": "唐代政治史述论稿",
        "作者": "陈寅恪 ",
        "读完日期": "Thu Mar 24 00:00:00 GMT 2022",
        "类别": [
            "历史传记",
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "欧也妮•葛朗台",
        "作者": "巴尔扎克 ",
        "读完日期": "Sat Mar 26 00:00:00 GMT 2022",
        "类别": [
            "文学"
        ],
        "备注": ""
    },
    {
        "标题": "民族主义（中英）",
        "作者": "泰戈尔 ",
        "读完日期": "Mon Apr 04 00:00:00 GMT 2022",
        "类别": [
            "社会科学",
            "英语"
        ],
        "备注": "双语版"
    },
    {
        "标题": "人生十论",
        "作者": "钱穆 ",
        "读完日期": "Tue Apr 05 00:00:00 GMT 2022",
        "类别": [
            "哲学"
        ],
        "备注": ""
    },
    {
        "标题": "论科学与艺术的复兴是否使风俗日趋淳朴",
        "作者": "卢梭 ",
        "读完日期": "Sat Apr 09 00:00:00 GMT 2022",
        "类别": [
            "社会科学",
            "哲学"
        ],
        "备注": ""
    },
    {
        "标题": "空袭中的沉思（中英）",
        "作者": "弗吉尼亚•伍尔芙 ",
        "读完日期": "Sat Apr 16 00:00:00 GMT 2022",
        "类别": [
            "文学",
            "英语"
        ],
        "备注": "双语版"
    },
    {
        "标题": "政治学",
        "作者": "亚里士多德 ",
        "读完日期": "Mon Apr 18 00:00:00 GMT 2022",
        "类别": [
            "社会科学",
            "哲学"
        ],
        "备注": ""
    },
    {
        "标题": "论自由",
        "作者": "密尔 ",
        "读完日期": "Sat Apr 30 00:00:00 GMT 2022",
        "类别": [
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "The Kite Runner",
        "作者": "khaled Hosseini 卡勒德•胡赛尼 ",
        "读完日期": "Tue May 10 00:00:00 GMT 2022",
        "类别": [
            "文学",
            "英语"
        ],
        "备注": "英文版"
    },
    {
        "标题": "天行者",
        "作者": "刘醒龙 ",
        "读完日期": "Sat May 14 00:00:00 GMT 2022",
        "类别": [
            "文学"
        ],
        "备注": ""
    },
    {
        "标题": "控制论与科学方法论",
        "作者": "金观涛 华国凡 ",
        "读完日期": "Sun May 15 00:00:00 GMT 2022",
        "类别": [
            "科普"
        ],
        "备注": ""
    },
    {
        "标题": "茶馆·龙须沟",
        "作者": "老舍 ",
        "读完日期": "Sun May 15 00:00:00 GMT 2022",
        "类别": [
            "文学"
        ],
        "备注": ""
    },
    {
        "标题": "高老头",
        "作者": "巴尔扎克 ",
        "读完日期": "Sat May 21 00:00:00 GMT 2022",
        "类别": [
            "文学"
        ],
        "备注": ""
    },
    {
        "标题": "百年孤独",
        "作者": "马尔克斯 ",
        "读完日期": "Sun Jun 05 00:00:00 GMT 2022",
        "类别": [
            "文学"
        ],
        "备注": "第二次读完"
    },
    {
        "标题": "To Kill a Mockingbird",
        "作者": "Harper Lee 哈珀·李 ",
        "读完日期": "Tue Jun 14 00:00:00 GMT 2022",
        "类别": [
            "文学",
            "英语"
        ],
        "备注": "英文版"
    },
    {
        "标题": "搞定（Get Things Done）",
        "作者": "戴维·艾伦 ",
        "读完日期": "Thu Jun 16 00:00:00 GMT 2022",
        "类别": [
            "其他"
        ],
        "备注": ""
    },
    {
        "标题": "平凡的世界 上",
        "作者": "路遥 ",
        "读完日期": "Thu Jul 07 00:00:00 GMT 2022",
        "类别": [
            "文学"
        ],
        "备注": ""
    },
    {
        "标题": "平凡的世界 中",
        "作者": "路遥 ",
        "读完日期": "Thu Jul 14 00:00:00 GMT 2022",
        "类别": [
            "文学"
        ],
        "备注": ""
    },
    {
        "标题": "平凡的世界 下",
        "作者": "路遥 ",
        "读完日期": "Sun Jul 17 00:00:00 GMT 2022",
        "类别": [
            "文学"
        ],
        "备注": ""
    },
    {
        "标题": "HTML5 网页设计入门",
        "作者": "Jeremy Keith ",
        "读完日期": "Tue Jul 19 00:00:00 GMT 2022",
        "类别": [
            "教程",
            "计算机"
        ],
        "备注": ""
    },
    {
        "标题": "CSS3 网页设计入门",
        "作者": "Dan Cederholm ",
        "读完日期": "Tue Jul 19 00:00:00 GMT 2022",
        "类别": [
            "教程",
            "计算机"
        ],
        "备注": ""
    },
    {
        "标题": "响应式 Web 设计",
        "作者": "Ben Frain  ",
        "读完日期": "Tue Jul 19 00:00:00 GMT 2022",
        "类别": [
            "教程",
            "计算机"
        ],
        "备注": ""
    },
    {
        "标题": "艺术 • 设计的色彩构成",
        "作者": "朝仓直巳 ",
        "读完日期": "Wed Jul 20 00:00:00 GMT 2022",
        "类别": [
            "美术设计"
        ],
        "备注": ""
    },
    {
        "标题": "废品生活：垃圾场的经济、社群与空间",
        "作者": "胡嘉明 张劼颖 ",
        "读完日期": "Wed Jul 20 00:00:00 GMT 2022",
        "类别": [
            "社会科学"
        ],
        "备注": ""
    },
    {
        "标题": "JS 语言精粹",
        "作者": "Douglas Crockford ",
        "读完日期": "Fri Jul 22 00:00:00 GMT 2022",
        "类别": [
            "教程",
            "计算机"
        ],
        "备注": ""
    },
    {
        "标题": "视觉机器",
        "作者": "保罗•维利里奥 ",
        "读完日期": "Sat Jul 23 00:00:00 GMT 2022",
        "类别": [
            "哲学"
        ],
        "备注": ""
    },
    {
        "标题": "JS 面向对象精要",
        "作者": "Nicholas C. Zakas ",
        "读完日期": "Sat Jul 23 00:00:00 GMT 2022",
        "类别": [
            "教程",
            "计算机"
        ],
        "备注": ""
    },
    {
        "标题": "而已集",
        "作者": "鲁迅 ",
        "读完日期": "Fri Aug 05 00:00:00 GMT 2022",
        "类别": [
            "文学"
        ],
        "备注": ""
    }
]

for (let i = 0; i < input.length; i++) {
    let date = new Date(input[i]["读完日期"]);
    input[i]["读完日期"] = date.getFullYear() + "-" +
    (date.getMonth() > 8 ? date.getMonth() + 1: "0" + (date.getMonth() + 1)) + "-" +
    (date.getDate() > 9 ? date.getDate(): "0" + date.getDate());

    let author = [];
    author.push(input[i]["作者"].trimEnd());
    input[i]["作者"] = author;
}

fs.writeFile('booklist.json', JSON.stringify(input), (err) => {
    if (err) throw err;
    console.log('The file has been saved!');
});